{
  "level_description": {
    "stage_1": {
      "text": [ "noch füllen" ],
      "emotion": "positiv"
    },
    "stage_2": {
      "text": [ "noch füllen" ],
      "emotion": "positiv"
    },
    "stage_3": {
      "text": [ "noch füllen" ],
      "emotion": "positiv"
    },
    "stage_4": {
      "text": [ "noch füllen" ],
      "emotion": "positiv"
    }
  },
  "level_complete": {
    "stage_1": {
      "text": [
        "Da hast du aber einen schönen Baum gepflanzt.",
        "Wir machen jetzt weiter in Stage 2",
        "Die Drag'n'Drop-Funktion ist jetzt deaktiviert.",
        "Damit die Maschine richtig arbeitet musst du jetzt oben links in die Textfelder die Regel zur Bildung des Baumes eintragen.",
        "Mit dem \"Prüfen\" Knopf kannst du sehen, ob du richtig liegst.",
        "Schau dir dazu einmal genauer an, wie im Baum der Index eines Elternknotens mit den Indizes seiner Kindknoten zusammenhängt."
      ],
      "emotion": "positiv"
    },
    "stage_2": {
      "text": [
        "Nun müsstest du wissen wie der Algorithmus den Baum mit Hilfe einer Bildungsvorschrift erstellt.",
        "Wir erreichen jetzt Stage 3",
        "Nun musst du zuerst den Heap herstellen, das heißt der Baum muss geordnet werden. Klicke dazu auf eine Verbindung zwischen zwei Kugeln, um diese zu tauschen.",
        "Angefangen wird dabei beim letzten Knoten, in dem die Ordnung noch nicht hergestellt ist. Durch das kategorische durchlaufen spart man sich unnötiges Tauschen.",
        "Mit dem (x)-Knopf kannst du den Heapstatus des entsprechenden Teilbaumes prüfen. Hat der gesamte Baum den Heapstatus erreicht, kommst du in die nächste Stufe."
      ],
      "emotion": "positiv"
    },
    "stage_3": {
      "text": [ "Diese Pyramide steht stabil." ],
      "emotion": "positiv"
    },
    "stage_4": {
      "text": [ "So langsam hast du den Sortieralgorithmus verstanden, oder?" ],
      "emotion": "positiv"
    }
  },
  "random_mistake": {
    "text": [
      "Wenn du weiter so machst werden wir beide noch gefeuert.",
      "Wenn du so weiter machst wirst du es nie verstehen!",
      "Versuche es einfach noch einmal!"
    ],
    "emotion": "angry"
  },
  "random_success": {
    "text": [
      "Super das ist ja fast wie meine eigen Arbeit.",
      "Das hätte ich nicht besser machen können.",
      "Wenn du so weiter machst kannst du bald an meiner Stelle stehen.",
      "Du hast das ausgezeichnet gemacht."
    ],
    "emotion": "positiv"
  },
  "level_hints": {
    "stage_1": {
      "text": [
        "Fülle den Baum von oben nach unten mit den Kugeln!",
        "Orientiere dich an der vorgegebenen Liste."
      ],
      "emotion": "explain"
    },
    "stage_2": {
      "text": [
        "Jede Ebene hat doppelt so viele Knote wie die vorherige.",
        "Die Indizes werden von der Wurzele bis zu den untersten Blättern, zeilenweise und aufsteigend vergeben."
      ],
      "emotion": "explain"
    },
    "stage_3": {
      "text": [
        "Achte darauf, dass die Kindknoten nicht größer als der Elternknoten sind.",
        "Am Ende muss das größte Element die Wurzel sein.",
        "Prüfe ob die Herstellung eines Heaps zwischen zwei Elementen einen anderen zerstört hat."
      ],
      "emotion": "explain"
    },
    "stage_4": {
      "text": [
        "Tausche doch die Wurzel mit dem untersten Blatt.",
        "Das unterste Blatt ist am weitesten von der Wurzel entfernt.",
        "Wenn du dir sicher bist das alles richtig ist, dann überprüfe es doch einfach mit dem Button."
      ],
      "emotion": "explain"
    }
  },
  "reaction_from_3": {
    "heap_destroy": {
      "text": [],
      "emotion": "neutral"
    },
    "not_last_subtree": {
      "text": [],
      "emotion": "neutral"
    },
    "change_little_one": {
      "text": [],
      "emotion": "neutral"
    },
    "first_change": {
      "text": [],
      "emotion": "neutral"
    },
    "reason_why_efficient": {
      "text": [],
      "emotion":  "neutral"
    }
  }
}
